{
    "id": "Gather-Game",
    "title": "Gather Game",
    "paragraph": "Gather Game is an unnamed ARPG and Story game that I’m developing in my free time, though the project is on a backburner.<br><br> Originally it was never intended to be a game. At the time the project started, I was playing the new Amazon MMO New World. While the game hard a pretty bad launch, the general consensus was that the gathering and crafting system was the best in the genre. This isn’t due to the mechanics, but the beauty of New World. The game has great graphics and an awesome world which makes it amazing to run around and relax in.<br><br> Despite knowing the mechanic wasn’t the interesting part, I still wanted to try my hand at recreating a similar gathering system in Unity. The method I came up with was to handle all the logic and data in Scriptable Objects to centralise all the code and avoid too many monobehaviours, and to ID which resource the player was harvesting, I would use Unity’s Tag feature and tag all the prefabs of those object types. This worked out quite effectively and it’s very simple to scale the system into 100’s of new resources should I need to.<br><br> However there was the issue of detecting when the player was close enough to a harvestable object. The solution I came up with was Spherecasting whenever the player moves, while this was effective, I was worried about the performance of constantly spherecasting so often and so I took the opportunity to learn about the new Unity Jobs and managed to get it working on a job, meaning the spherecasts were completely threaded.<br><br> The last development to the game was the inventory, looting and crafting system I was working on, which required a lot of UI work. I’m not the biggest lover of Unity’s IMGUI and found its new USS and UXML UI Toolkit to feel a lot more intuitive, which inspired me to learn Web Development, CSS and HTML as it’s so similar.<br><br> The project needs a lot of rewritten code for its UI and Inventory and I still work on it from time to time as I feel like it, but it isn’t a priority project at this time and is just a bit of fun. The level is just a test area and is VERY barebones and not reflective of the final vision in any way.",
    "imageURL": "./Assets/Projects/Game Development/0_Gather Game/Media/GatherGame 1.gif",
    "caption": "Gather Game display"
}