{
    "id": "fallout-riften",
    "title": "Fallout Riften",
    "paragraph": "For the second instalment of my Fallout Skyrim project, I'm focusing on Riften. The goal here is to transform the city into a deserted, apocalyptic landscape, while simultaneously enhancing its aesthetic and gameplay experience. My vision is to depict a city that has been abandoned for a century, now overgrown, looted, and empty, yet still retaining its unique charm.<br> <br>Riften, known as the city of thieves, is now characterized by its verticality and intricate navigational paths. Almost every rooftop is interconnected, creating a maze-like environment that reflects the city's affiliation with the Thieves Guild. I've redesigned the city to offer multiple pathways and secret routes, making it a paradise for thieves.<br> <br>However, Riften is more than just a den of thieves. It boasts a proud fishery and a renowned meadery, the latter being controlled by a corrupt family that practically run the city. To showcase these landmarks, the city will be littered with fishing nets, fish skeletons, and empty bottles of mead.<br><br> In my workflow, I first create the city in its pre-apocalyptic state, complete with detailed architecture and clutter. Then, I introduce elements of decay by adding ivy, moss, and foliage, giving the city a neglected and overrun appearance. Debris, sawdust, and toppled furniture are scattered around, hinting at looting and invasion. The final touch involves adding skeletons, gore, and broken architectural elements to convey the aftermath of destruction.<br><br> While there is more to showcase on the Level Art, I ensure that the gameplay remains engaging. In Fallout Riftens intended brother mod, World Eater, players will encounter challenges posed by dragons and the undead. To address feedback on difficulty in World Eater, I've redesigned the city to provide more cover and strategic pathways. The revamped architecture offers refuge from dragon attacks while allowing players to confront the undead more effectively in between.<br><br> Overall, my approach blends artistic creativity with thoughtful level design, creating an immersive gaming experience that stays true to the Fallout Skyrim universe. The mod is far from finished though, with plenty more to do in the other districts of the city, and a fair few interiors to open and “ruin”. <br>",
    "imageURL": "./Assets/Projects/Level Design/0_Fallout Riften/Media/FoRiften 1.gif",
    "caption": "Fallout Riften pictures, still a WIP and will change"
}

