{
    "id": "skyrim-badly-translated",
    "title": "Skyrim Badly Translated",
    "paragraph": "Google Translate meets Skyrim meets AI voice synthesis in this new mod made by EXIT (me) and Formerly Blue. What happens when you Google Translate the item names, NPC names, NPC dialogue, and more through 40 different languages then back to English? A modded equivalent of the 'telephone' game with wildly messed up text, a new story, and some really weird characters! <br><br> It's been done before for Paper Mario, Hollow Knight, and Undertale. Now Skyrim finally has a badly translated mod sitting at over 3 million views across many different videos and channels and a fantastic reception from its viewers!<br><br> Initially, this mod started out as a very tedious manual task of translating each voice line, item, name, etc in google translate 40 times, and then putting each one in game one by one. Eventually we developed tools to automate the translations, tools to automate the voice generation via Elevenlabs and most importantly, a way to automate the subtitle translation with a script.<br><br> To understand why translating subtitles were so important, you need to understand how the voices in the Creation Engine work. When a new piece of dialogue is created in game, it is assigned a file name automatically in the folder of whichever voice type is used. Any .wav file with that name in that location will be played by that voice line. However, to have it play in game you need to generate the .lip file (which determines the lipsync) and combine that with the .wav file to create a .fuz file.<br><br> While Blue handled all of the AI voice generation, I handled converting the files from a .mp3 to a .wav. Then through a script I wrote in Delphi, I had to read a csv file and match each ID to its in game counterpart, then replace that line (which would get even more complex when dialogue had multiple responses), then mass generate the lip files and finally merge all the .wav and .lip files into the final .fuz file. Overall, this was done to about 90,000 dialogue lines.<br><br> The names of the items, npcs, spells, etc were a fair bit simpler. I wrote a script (again in Delphi) to print all the names that I needed, then I ran those through a translator 40 times and ran another script to automatically put the names back in game, in the same order they were printed.<br><br> While the mod isn’t full complete, I feel proud of Blue and I’s accomplishment and the 100’s of hours we poured into making this project a reality, even if it is gibberish and completely silly.",
    "imageURL": "./Assets/Projects/Other Projects/0_Skyrim Badly Translated/Media/BadlyTranslated 1.png",
    "caption": "<a href=https://www.youtube.com/watch?v=YWtoD3ogK4Y> This </a> is a video by my co-creator, Formerly Blue"
}