{
    "id": "kingdom-crafter",
    "title": "Kingdom Crafter",
    "paragraph": "Kingdom Crafter was a game originally in development to pass an exam at my A Levels (eventually cancelled due to COVID).<br><br> The plan was to create an infinite Voxel world akin to Minecraft, and guide the player through creating a self sufficient village. It was essentially Minecraft combined with a City Builder.<br><br> Players would be able to create individual buildings block by block, if those buildings were valid it would then be possible to place “work blocks” inside those buildings and assign workers to it. Those workers would then be able to automatically do whichever designated action the station was programmed to do.<br><br> This was my first large scale Unity projects and looking back on the code, it wasn’t great. However, as many programmers say, there’s always one project that breaks that entry barrier for you and Kingdom Crafter was certainly that for me. The program would generate each quad of each block, add them to a chunk, apply a noise algorithm to it (in this case it was simplex noise) and then place the chunk in the world. The chunk method is not the only way to do procedural and voxel generation but for this case it made the most sense. It allows the computer to only render a certain amount of chunks around the player instead of the entire world, which would theoretically be impossible because its infinite. Any quads that weren’t in view of the player were also invisble and unrendered to further optimise the chunks. Chunk generation is slow and the biggest challenge was creating thread safe code in Unity. At the time Unity didn’t support threading natively with the jobs system, so a lot of Unity based functions couldn’t be threaded and creating thread safe and safely synced code was difficult and left plenty of room for improvement.<br><br>  Kingdom Crafter also had the Workers and their jobs implemented, even if it was primitive. Workers would be able to pathfind based on a pathfinding algorithm that I made, and at the end of the day would all return to their beds, which were classified as jobs. <br><br>The Project was never finished due to COVID, by the time I returned to the project the code seemed so inefficient and badly written it would’ve needed a re-write.",
    "imageURL": "./Assets/Projects/Game Development/1_Kingdom Crafter/Media/KingdomCraft 1.png",
    "caption": "Kingdom Crafter Screenshots"
}