{
    "id": "fallout-whiterun",
    "title": "Fallout Whiterun",
    "paragraph": "Fallout Whiterun kicks off my ambitious Fallout Skyrim project, aiming to turn the city into a hauntingly beautiful yet desolate landscape. The vision? A city abandoned for a century, reclaimed by nature but still echoing its former grandeur and secrets.<br><br> Whiterun, Skyrim's bustling trade capital, is divided into three distinct districts: the Plains, the Wind, and the Cloud. Each holds its own tales and treasures. From the revered Gildergreen to the storied Companions' hall, there's history in every corner.<br><br> In my adaptation, I've taken advantage of Whiterun's existing wear and tear to focus on storytelling. The Plains district, once a hub of activity, now lies silent and looted. But for the discerning eye, hidden caches of loot still await discovery.<br><br> Venturing into the Wind district, where Whiterun's elite once resided, reveals a scene of faded grandeur. Here, feuding clans' grand manors stand as testament to past rivalries. I've added touches of gothic atmosphere to the temple and graveyard, enhancing the district's eerie charm.<br><br> The Cloud district, home to the majestic Dragonsreach, sees subtle enhancements to its exterior. But it's within these walls that the true heart of the story beats. Despite the looting, remnants of the city's past lie waiting to be uncovered.<br><br> At the center of Fallout Whiterun's lore lies the Gildergreen, a symbol of both hope and decay. Through scattered journals and notes, players piece together a tale of nature's resurgence and mankind's folly. Wildlife now roams freely amidst the ruins, adding a sense of life to the desolation.<br><br> While architectural changes are minimal in this iteration, future updates may introduce bespoke assets to enrich the cityscape. Additionally, level design has been tweaked to align with the intended difficulty curve of the companion mod, World Eater. Players will face formidable challenges as they navigate the city's treacherous streets.<br><br> In essence, Fallout Whiterun aims to offer players a richly detailed and immersive experience, where every corner holds a story and every challenge brings new discoveries. that used to roam the city have been moved inside the palace and the dragon that roamed the sky now rests on the balcony of Dragonsreach, allowing the player to fight the creature undisturbed. <br><br> This is only a fraction of the detail and passion that I put into this mod. Really to see it in full, you have to play it, but I hope this gives a brief introduction and insight into my work and mind.",
    "imageURL": "./Assets/Projects/Level Design/1_Fallout Whiterun/Media/FoWhiterun 1.gif",
    "caption": "Fallout Whiterun pictures - <a href=https://www.youtube.com/watch?v=jXDEHhx1IsE&t> See the Player Home here </a>"
}